#include <stdio.h>
int main(void) {
	// 별 쌓기
	// 별 5개로 1줄
	// ex)*****	

/*	for (int i = 1; i <= 5 ; i++) {
		printf("*");
	}
*/

//-------------------------------------------------
	// 별 쌓기2
	// 별 5개로 2줄, 이중 반복문 사용
	// ex) *****
	//     *****
/*	for (int i = 1; i <= 2; i++) {
		for (int j = 1; j <= 5; j++) {
			printf("*");
		}
		printf("\n");
	}
*/
//-------------------------------------------------
/*	//별 쌓기3
	//별 5개로 N줄, 내가 원하는 만큼 별
	//ex) 줄과 별을 입력해주십쇼 예시)2 3
	//	***
	//  ***
	printf("줄과 별을 입력해주세요 ex)2 3 \n");
	int N, n;
	scanf_s("%d %d", &N, &n);
	for (int i = 1; i <= N; i++) {
		for (int k = 1; k <= n; k++) {
			printf("*");
		}
		printf("\n");
	}
*/
//-------------------------------------------------
	// 별 삼각형(기본)
	// ex) 
	//*
	//**
	//***
	//****
	//*****
/*
	for (int i = 0; i < 5; i++) {
		for (int j = 0 ; j <= i ; j++) {
			printf("*");
		}
		printf("\n");
	}

*/
//-------------------------------------------------
	//별 삼각형(응용)
	// ex)3입력
	//*
	//**
	//***
/*
	int N;
	scanf_s("%d", &N);
	for (int i = 1; i <= N; i++) {
		for (int k = 1; k <= i; k++) {
			printf("*");
		}
		printf("\n");
	}
*/
//-------------------------------------------------
	//별 5개에서 빼기
	//ex)
	//*****
	//****
	//***
	//**
	//*
/*	for (int i = 0; i <= 5; i++) {
		for (int j = i; j <= 5 - 1; j++) {
			printf("*");
		}
		printf("\n");
	}
*/
//-------------------------------------------------
	//별 5개에서 빼기 응용
	//ex)입력 4
	//****
	//***
	//**
	//*
/*	printf("별을 입력하세요\n");
	int N;
	scanf_s("%d", &N);
	for (int i = 0; i <= N; i++) {
		for (int j = i; j <= N - 1; j++) {
			printf("*");
		}	
		printf("\n");
	}
*/

//-------------------------------------------------
	//별 삼각형 오른쪽
	//ex
	//     *
	//    **
	//	 ***
	//  ****
	// *****
/*	for (int i = 0; i <= 5; i++) {
		for (int j = i ; j <= 5-1; j++) {
			printf(" ");
		}
		for (int k = 1; k <= i; k++) {
			printf("*");
		}
		printf("\n");
	}
	*/
//-------------------------------------------------
	//별 삼각형 오른쪽 응용
	//ex) 입력 5
	//        *
	//       **
	//      ***
	//     ****
	//    *****

/*	printf("몇줄로 하겠습니까?\n");
	int N;
	scanf_s("%d", &N);
	for (int i = 0; i <= N; i++) {
		for (int j = i; j <= N - 1 ; j++) {
			printf(" ");
		}
		for (int k = 0; k < i; k++) {
			printf("*");
		}
		printf("\n");
	}
*/
//-------------------------------------------------	
	//별쌓기의 최종 프로젝트..?
	// 피라미드
	// ex) 3입력
	//     *
	//	  ***
	//   *****
	int floor;
	printf("몇층으로 쌓을건가요?\n");
	scanf_s("%d", &floor);
	for (int i = 0; i <= floor; i++) {
		for (int j = i; j <= floor - 1; j++) {
			printf(" ");
		}
		for (int k = 0; k <i*2+1 ; k++) {
			printf("*");
		}
		printf("\n");
	}

	return 0;
}